ka2_2024/src/Documents/НачислениеСписаниеРезервовПредстоящихРасходов/НачислениеСписаниеРезервовПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>InformationRegister.СтавкиДисконтированияРезервов</registerRecords>
  <registerRecords>AccumulationRegister.РезервыПредстоящихРасходов</registerRecords>
  <registerRecords>InformationRegister.СрокиДисконтированияРезервовПредстоящихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Резервы</name>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектУчетаРезервов</name>
      <type>
        <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСуммаНУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюСуммуРегл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяСуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюСуммаУпр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяСуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюДатуИсполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюСуммуНУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяСуммаНУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеНачисления</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиНачисления</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовНачисления</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовНачисления</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСписания</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиСписания</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовСписания</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходовСписания</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/НачислениеСписаниеРезервовПредстоящихРасходов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПредставлениеПериода = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
	
	ПараметрыВыбораСтатейИАналитик = Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ПараметрыВыбораСтатейИАналитик(Перечисления.ХозяйственныеОперации.ПустаяСсылка());
	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПредставлениеПериода = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
	
	ПараметрыВыбораСтатейИАналитик = Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ПараметрыВыбораСтатейИАналитик(Перечисления.ХозяйственныеОперации.ПустаяСсылка());
	ДоходыИРасходыСервер.ПриЧтенииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ДоходыИРасходыСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
	ЗаполнитьПризнакРазничногоФормированияБУиНУ();
	
	СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПроверитьСоответствиеРеквизитовРезервам();
	
	ЗаполнитьРеквизитыФормы();
	
	УстановитьСвойстваЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРезервовПриИзменении(Элемент)
	
	ПроверитьСоответствиеРеквизитовРезервам();
	
	ЗаполнитьРеквизитыФормы();
	
	УстановитьСвойстваЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы 	   = Новый Структура("Значение, РежимВыбораПериода", Объект.Дата, "МЕСЯЦ");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода",
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,
		,
		, 
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.Дата = НачалоМесяца(Объект.Дата);
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(
		Направление,
		СтандартнаяОбработка,
		Объект.Дата,
		ПредставлениеПериода);
	Объект.Дата = КонецМесяца(Объект.Дата);
	
	ЗаполнитьРеквизитыФормы();

	УстановитьСвойстваЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезервы

&НаКлиенте
Процедура РезервыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ДоходыИРасходыКлиентСервер.ПриДобавленииСтрокиВТаблицу(ЭтотОбъект, Элементы.Резервы.ТекущиеДанные, "Объект.Резервы");
КонецПроцедуры

&НаКлиенте
Процедура РезервыОбъектУчетаРезервовПриИзменении(Элемент)
	
	Если Элементы.Резервы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДаннымиРегистра(Элементы.Резервы.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РезервыСтатьяРасходовНачисленияПриИзменении(Элемент)
	ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезервыСтатьяРасходовНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоходыИРасходыКлиент.НачалоВыбораСтатьи(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РезервыСтатьяДоходовСписанияПриИзменении(Элемент)
	ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезервыСтатьяДоходовСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоходыИРасходыКлиент.НачалоВыбораСтатьи(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РезервыАналитикаРасходовНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоходыИРасходыКлиент.НачалоВыбораАналитикиРасходов(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РезервыАналитикаРасходовНачисленияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ДоходыИРасходыКлиент.АвтоПодборАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РезервыАналитикаРасходовНачисленияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДоходыИРасходыКлиент.ОкончаниеВводаТекстаАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	 РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура ЗагрузкаДанныхИзФайла(Команда)
	
	Если Объект.Резервы.Количество() Тогда
		ПараметрыОповещения = Новый Структура("ИмяСобытия", Команда.Имя);
		ОчисткаТЧОписаниеОповещения = Новый ОписаниеОповещения("ВопросОчисткиТабличнойЧастиЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = НСтр("ru = 'Очистить таблицу резервов перед заполнением по данным из файла?'");
		ПоказатьВопрос(ОчисткаТЧОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗагрузитьДанныеИзФайлаНачало();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Перед заполнением резервов необходимо заполнить организацию документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Организация", "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидРезервов) Тогда
		ТекстСообщения = НСтр("ru = 'Перед заполнением резервов необходимо заполнить вид резервов документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ВидРезервов", "Объект.ВидРезервов");
		Возврат;
	КонецЕсли;
	
	Если Объект.Резервы.Количество() Тогда
		ПараметрыОповещения = Новый Структура("ИмяСобытия", Команда.Имя);
		ОчисткаТЧОписаниеОповещения = Новый ОписаниеОповещения("ВопросОчисткиТабличнойЧастиЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = НСтр("ru = 'Очистить таблицу резервов перед заполнением по данным регистра?'");
		ПоказатьВопрос(ОчисткаТЧОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗаполнитьТЧДаннымиРегистра();
	КонецЕсли;
		
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Элементы.РезервыТекущаяСуммаНУ.Видимость         = Ложь;
	Элементы.РезервыУстановитьНовуюСуммуНУ.Видимость = Ложь;
	Элементы.РезервыНоваяСуммаНУ.Видимость           = Ложь;
	
	ЗаполнитьСлужебныеРеквизитыФормы();
	
	НачислениеСписаниеРезервовПредстоящихРасходовЛокализация.ПриЧтенииСозданииНаСервере(ЭтотОбъект);
	
	ЗаполнитьПризнакРазничногоФормированияБУиНУ();
	УстановитьСвойстваЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыНоваяСуммаРегл.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Резервы.УстановитьНовуюСуммуРегл");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без изменений>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыНоваяСуммаУпр.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Резервы.УстановитьНовуюСуммаУпр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без изменений>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыНоваяСуммаНУ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Резервы.УстановитьНовуюСуммуНУ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без изменений>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыНоваяДатаИсполнения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Резервы.УстановитьНовуюДатуИсполнения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без изменений>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыНоваяСуммаНУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыУстановитьНовуюСуммуНУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезервыТекущаяСуммаНУ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Резервы.ДопускаетсяРазличноеФормированиеРезервовБУиНУ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Установка видимости сумм упр. учет в зависимости от ФО.
	
	ИменаЭлементовУпрУчета = Новый Массив;
	ИменаЭлементовУпрУчета.Добавить("РезервыТекущаяСуммаУпр");
	ИменаЭлементовУпрУчета.Добавить("РезервыУстановитьНовуюСуммаУпр");
	ИменаЭлементовУпрУчета.Добавить("РезервыНоваяСуммаУпр");
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	Для Каждого ИмяЭлементаУпрУчета Из ИменаЭлементовУпрУчета Цикл
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлементаУпрУчета);
		
	КонецЦикла;

	НачалоПериодаИспользованияУУ  = РасчетСебестоимостиПовтИсп.ДатаНачалаВеденияУправленческогоУчетаОрганизаций();
	НачалоПериодаИспользованияПУ22 = РасчетСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
	ПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22();
	УправленческийУчетОрганизаций = РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций();
	
	ГруппаИли = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Дата");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Макс(НачалоПериодаИспользованияПУ22, НачалоПериодаИспользованияУУ);
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = ПартионныйУчетВерсии22 И УправленческийУчетОрганизаций;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

// Устанавливает свойства элементов формы
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма документа
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементов(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СтавкаДисконтирования.Видимость = Форма.ДисконтированиеОценочногоОбязательства;
	
	Элементы.РезервыДатаИсполнения.Видимость                = Форма.ДисконтированиеОценочногоОбязательства;
	Элементы.РезервыУстановитьНовуюДатуИсполнения.Видимость = Форма.ДисконтированиеОценочногоОбязательства;
	Элементы.РезервыНоваяДатаИсполнения.Видимость           = Форма.ДисконтированиеОценочногоОбязательства;
	
	Элементы.РезервыТекущаяСуммаНУ.Видимость         = Не Форма.ЭтоРезервыЛиквидационныхОбязательств;
	Элементы.РезервыУстановитьНовуюСуммуНУ.Видимость = Не Форма.ЭтоРезервыЛиквидационныхОбязательств;
	Элементы.РезервыНоваяСуммаНУ.Видимость           = Не Форма.ЭтоРезервыЛиквидационныхОбязательств;
	
КонецПроцедуры

#Область ЗаполнениеТабличнойЧасти

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаНачало()
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "НачислениеСписаниеРезервовПредстоящихРасходов.Резервы";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка резервов из файла'");
	ПараметрыЗагрузки.КолонкиМакета = ОписаниеКолонокМакетаДляЗагрузкиИзФайла();
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	СтрокиИзменены = Ложь;
	
	ОбъектыУчетаРезервов = ОбщегоНазначения.ВыгрузитьКолонку(ЗагруженныеДанные, "ОбъектУчетаРезервов", Истина);
	
	ПараметрыЗаполненияРезервов = Новый Структура("Дата, Ссылка, Организация, ВидРезервов");
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполненияРезервов, Объект);
	Результат = Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ДанныеДляЗаполненияРезервов(ПараметрыЗаполненияРезервов, ОбъектыУчетаРезервов);
	
	Выборка  = Результат.Выбрать();
	
	Если ЗагруженныеДанные.Количество() <> Выборка.Количество() Тогда
		Сообщение = НСтр("ru = 'Не для всех загружаемых строк были найдены соответствия в справочнике ""Объекты учета резервов"". Не все строки были загружены.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, Объект.Ссылка, "Объект.Резервы");
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ОбъектУчетаРезервов", Выборка.ОбъектУчетаРезервов);
		МассивСтрокСТекущимОбъектомРезервов = Объект.Резервы.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрокСТекущимОбъектомРезервов.Количество() Тогда
			СтрокаРезерва = МассивСтрокСТекущимОбъектомРезервов.Получить(0);
		Иначе
			СтрокаРезерва = Объект.Резервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерва, Выборка);
			СтрокиИзменены = Истина;
		КонецЕсли;
		ЗагруженныеСтроки = ЗагруженныеДанные.НайтиСтроки(СтруктураПоиска);
		Для каждого НайденнаяСтрока Из ЗагруженныеСтроки Цикл
			СтрокаРезерва.НоваяСуммаРегл = СтрокаРезерва.НоваяСуммаРегл + НайденнаяСтрока.НоваяСуммаРегл;
			СтрокаРезерва.НоваяСуммаУпр = СтрокаРезерва.НоваяСуммаУпр + НайденнаяСтрока.НоваяСуммаУпр;
			СтрокаРезерва.НоваяСуммаНУ = СтрокаРезерва.НоваяСуммаНУ + НайденнаяСтрока.НоваяСуммаНУ;
		КонецЦикла;
		СтрокаРезерва.УстановитьНовуюСуммуРегл = ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаРегл);
		СтрокаРезерва.УстановитьНовуюСуммаУпр = ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаУпр);
		СтрокаРезерва.УстановитьНовуюСуммуНУ = ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаНУ);
		СтрокиИзменены = СтрокиИзменены ИЛИ ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаРегл)
			ИЛИ ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаУпр) ИЛИ ЗначениеЗаполнено(СтрокаРезерва.НоваяСуммаНУ);
	КонецЦикла;
	
	Если СтрокиИзменены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчисткиТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Резервы.Очистить();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена И ДополнительныеПараметры.ИмяСобытия <> "ИзменениеРеквизитов" Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ИмяСобытия = "Заполнить" Тогда
		ЗаполнитьТЧДаннымиРегистра();
	ИначеЕсли ДополнительныеПараметры.ИмяСобытия = "ЗагрузкаДанныхИзФайла" Тогда
		ЗагрузитьДанныеИзФайлаНачало();
	ИначеЕсли ДополнительныеПараметры.ИмяСобытия = "ИзменениеРеквизитов" И Результат <> КодВозвратаДиалога.Да Тогда
		Объект.ВидРезервов = ДополнительныеПараметры.СтарыеРеквизиты.ВидРезервов;
		Объект.Организация = ДополнительныеПараметры.СтарыеРеквизиты.Организация;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДаннымиРегистра(ИдентификаторСтроки = Неопределено)
	
	ОбъектыУчетаРезервов = Новый Массив;
	// Если Идентификатор строки не определен - значит заполняем всю табличную часть
	Если ИдентификаторСтроки <> Неопределено Тогда
		СтрокаРезерва = Объект.Резервы.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаРезерва <> Неопределено Тогда
			// Проверим, есть ли такой объект учета в списке, и если есть, то выдадим сообщение об ошибке:
			СтруктураПоиска = Новый Структура("ОбъектУчетаРезервов", СтрокаРезерва.ОбъектУчетаРезервов);
			МассивСтрокСТекущимОбъектомРезервов = Объект.Резервы.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрокСТекущимОбъектомРезервов.Количество() > 1 Тогда
				Для каждого СтрокаТекущегоОбъекта Из МассивСтрокСТекущимОбъектомРезервов Цикл
					Если СтрокаТекущегоОбъекта.ПолучитьИдентификатор() <> ИдентификаторСтроки Тогда
						ТекстОшибки = НСтр("ru = 'Строка с введенным объектом учета резервов уже есть в документе.'");
						Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Резервы", СтрокаТекущегоОбъекта.НомерСтроки, "ОбъектУчетаРезервов");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, Путь);
						СтрокаРезерва.ОбъектУчетаРезервов = Справочники.ОбъектыУчетаРезервовПредстоящихРасходов.ПустаяСсылка();
					КонецЕсли;
				КонецЦикла;
				Возврат;
			КонецЕсли;
			ОбъектыУчетаРезервов.Добавить(СтрокаРезерва.ОбъектУчетаРезервов);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаполненияРезервов = Новый Структура("Дата, Ссылка, Организация, ВидРезервов");
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполненияРезервов, Объект);
	Результат = Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ДанныеДляЗаполненияРезервов(ПараметрыЗаполненияРезервов, ОбъектыУчетаРезервов);
	
	Выборка  = Результат.Выбрать();
	
	Если ОбъектыУчетаРезервов.Количество() = 0 Тогда
		Пока Выборка.Следующий() Цикл
			СтруктураПоиска = Новый Структура("ОбъектУчетаРезервов", Выборка.ОбъектУчетаРезервов);
			МассивСтрокСТекущимОбъектомРезервов = Объект.Резервы.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрокСТекущимОбъектомРезервов.Количество() Тогда
				СтрокаРезерва = МассивСтрокСТекущимОбъектомРезервов.Получить(0);
				ЗаполнитьЗначенияСвойств(СтрокаРезерва, Выборка, "ТекущаяСуммаРегл,ТекущаяСуммаНУ,ТекущаяСуммаУпр,ДатаИсполнения");
			Иначе
				СтрокаРезерва = Объект.Резервы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезерва, Выборка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРезерва, Выборка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеРеквизитовРезервам()
	
	Если Объект.Резервы.Количество() Тогда
		
		ОбъектУчетаРезервов = Неопределено;
		Для каждого СтрокаРезерва Из Объект.Резервы Цикл
			Если ЗначениеЗаполнено(СтрокаРезерва.ОбъектУчетаРезервов) Тогда
				ОбъектУчетаРезервов = СтрокаРезерва.ОбъектУчетаРезервов;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбъектУчетаРезервов = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РеквизитыРезерва = ДанныеРезерва(ОбъектУчетаРезервов);
		
		Если РеквизитыРезерва.Организация <> Объект.Организация
			ИЛИ РеквизитыРезерва.ВидРезервов <> Объект.ВидРезервов Тогда
			
			ПараметрыОповещения = Новый Структура("ИмяСобытия, СтарыеРеквизиты", "ИзменениеРеквизитов", РеквизитыРезерва);
			ОчисткаТЧОписаниеОповещения = Новый ОписаниеОповещения("ВопросОчисткиТабличнойЧастиЗавершение", ЭтотОбъект, ПараметрыОповещения);
			ТекстВопроса = НСтр("ru = 'Таблица резервов будет очищена. Продолжить?'");
			ПоказатьВопрос(ОчисткаТЧОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеРезерва(ОбъектУчетаРезервов)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектУчетаРезервов, "Организация, ВидРезервов");
	
КонецФункции

// Заполняет в табличной части Резрвы признак "ДопускаетсяРазличноеФормированиеРезервовБУиНУ"
//
// Параметры:
//  ОбъектУчетаРезервов  - СправочникСсылка.ОбъектыУчетаРезервовПредстоящихРасходов - отбор для табличной части.
//                          Если параметр не передан, то заполнятся по всем объектам учета резервов
//
&НаСервере
Процедура ЗаполнитьПризнакРазничногоФормированияБУиНУ(ОбъектУчетаРезервов = Неопределено)

	ПараметрыОтбора = Новый Структура;
	
	Если ОбъектУчетаРезервов <> Неопределено Тогда
		ПараметрыОтбора.Вставить("ОбъектУчетаРезервов", ОбъектУчетаРезервов);
	КонецЕсли;
	
	ТаблицаРезервов = Объект.Резервы.Выгрузить(ПараметрыОтбора, "ОбъектУчетаРезервов");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРезервов", ТаблицаРезервов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРезервов.ОбъектУчетаРезервов КАК ОбъектУчетаРезервов
		|ПОМЕСТИТЬ ТаблицаРезервов
		|ИЗ
		|	&ТаблицаРезервов КАК ТаблицаРезервов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезервов.ОбъектУчетаРезервов КАК ОбъектУчетаРезервов,
		|	ВЫРАЗИТЬ(ТаблицаРезервов.ОбъектУчетаРезервов КАК Справочник.ОбъектыУчетаРезервовПредстоящихРасходов).ДопускаетсяРазличноеФормированиеРезервовБУиНУ КАК ДопускаетсяРазличноеФормированиеРезервовБУиНУ
		|ИЗ
		|	ТаблицаРезервов КАК ТаблицаРезервов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОбъектУчетаРезервов", Выборка.ОбъектУчетаРезервов);
		СтрокиРезервов = Объект.Резервы.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого Строка Из СтрокиРезервов Цикл
			ЗаполнитьЗначенияСвойств(Строка, Выборка, "ДопускаетсяРазличноеФормированиеРезервовБУиНУ");
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеКолонокМакетаДляЗагрузкиИзФайла()
	
	КолонкиМакета = Новый Массив;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("ОбъектУчетаРезервов",
		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)), НСтр("ru = 'Объект учета резервов'"));
	Колонка.Подсказка = НСтр("ru = 'Наименование объекта учета резервов для поиска'");
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("НоваяСуммаРегл",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла()), НСтр("ru = 'Новая сумма (регл.)'"));
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("НоваяСуммаУпр",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла()), НСтр("ru = 'Новая сумма (упр.)'"));
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("НоваяСуммаНУ",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла()), НСтр("ru = 'Новая сумма (НУ)'"));
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("НоваяДатаИсполнения",
		Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)), НСтр("ru = 'Новая дата исполнения'"));
	КолонкиМакета.Добавить(Колонка);
	
	Для Позиция = 0 По КолонкиМакета.Количество()-1 Цикл
		КолонкиМакета[Позиция].Родитель = Колонка.Имя;
		КолонкиМакета[Позиция].Позиция = Позиция;
	КонецЦикла;
	
	Возврат КолонкиМакета;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Объект.Дата = КонецМесяца(ВыбранныйПериод);
	ПредставлениеПериода = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
	
	ЗаполнитьРеквизитыФормы();

	УстановитьСвойстваЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	
	ЗаполнитьСлужебныеРеквизитыФормы();
	
	Если ДисконтированиеОценочногоОбязательства Тогда
		Объект.СтавкаДисконтирования = ПолучитьСтавкуДисконтированияОценочногоОбязательства(
			Объект.Организация, Объект.ВидРезервов, Объект.Дата);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыФормы()
	
	Если ЗначениеЗаполнено(Объект.ВидРезервов) Тогда
		РеквизитыВидаРезервов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.ВидРезервов, "ДисконтированиеРезервов, ТипРезерва");
		ДисконтированиеОценочногоОбязательства = РеквизитыВидаРезервов.ДисконтированиеРезервов;
		
		Если Не ИспользуетсяУчетДисконтированияРезервов() Тогда
			ДисконтированиеОценочногоОбязательства = Ложь;	
		КонецЕсли;
		
		ЭтоРезервыЛиквидационныхОбязательств = РеквизитыВидаРезервов.ТипРезерва
			= ПредопределенноеЗначение("Перечисление.ТипыРезервовПредстоящихРасходов.ЛиквидационныеОбязательства");
	Иначе
		ДисконтированиеОценочногоОбязательства = Ложь;
		ЭтоРезервыЛиквидационныхОбязательств = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИспользуетсяУчетДисконтированияРезервов()
	
	Используется = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Дата) 
		И ДисконтированиеОценочногоОбязательства Тогда
		
		Используется = РезервыПредстоящихРасходов.ИспользуетсяУчетДисконтированияРезервов(КонецМесяца(Объект.Дата), 
			Объект.Организация);
	КонецЕсли;
		
	Возврат Используется;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавкуДисконтированияОценочногоОбязательства(Организация, ВидРезервов, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкиДисконтированияРезервов.СтавкаДисконтирования КАК СтавкаДисконтирования
		|ИЗ
		|	РегистрСведений.СтавкиДисконтированияРезервов.СрезПоследних(&Дата, Организация = &Организация
		|	И ВидРезервов = &ВидРезервов) КАК СтавкиДисконтированияРезервов";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидРезервов", ВидРезервов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаДисконтирования;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
